# Imports

In [1]:
import pandas as pd

# Reading data into dataframe tables

In [33]:
employee = pd.read_csv("queries_data/employee.csv")
employee

   ssn   fname       lname sex  salary  super_ssn  dno
0    1   peter  skachovsky   m    1000        2.0   10
1    2  ronald      dehaan   m    2000        4.0   10
2    3   alina     petrova   f    1500        2.0   10
3    4  sergey   paramonov   m    4000        NaN   20
4    5   andra     busoniu   f    2500        NaN   30

In [34]:
works_on = pd.read_csv("queries_data/works_on.csv")
works_on

   essn  pno  hours
0     1    1     10
1     1    2     20
2     1    3      5
3     1    4     10
4     1    5      3
5     2    1     10
6     2    5     10
7     3    2     10
8     4    4     40

In [4]:
project = pd.read_csv("queries_data/project.csv")
project.head()

  pname  pnumber plocation  dnum
0     A        1   Dresden    10
1     A        2   Bolzano    10
2     C        3    Moscow    20
3     X        4    Vienna    30
4     Z        5   Houston    20

In [35]:
XXX = "pno == @ps"
YYY = "ssn in @ssns"
ZZZ = "essn" 
ps = len(project.pnumber) 
pno_set = works_on[['essn','pno']].groupby(by=ZZZ).count()
ssns = pno_set.query(XXX).reset_index()['essn'] 
output = employee.query(YYY) [["fname","lname"]]

In [29]:
employee[employee['fname'] == 'peter']

   ssn  fname       lname sex  salary  super_ssn  dno
0    1  peter  skachovsky   m    1000        2.0   10

In [5]:
ps = len(project.pnumber)

In [30]:
works_on[works_on['essn'] == 1]

   essn  pno  hours
0     1    1     10
1     1    2     20
2     1    3      5
3     1    4     10
4     1    5      3

In [32]:
output

    fname      lname
1  ronald     dehaan
2   alina    petrova
3  sergey  paramonov
4   andra    busoniu

In [26]:
ps

5

# Good old queries but now in pandas!

The same problems but in a different paradigm

# Пишем старые добрые запросы, но уже ручками на pandas 

В общем-то те же запросы, что мы видели на реляционной алгебре, реляционном исчислении и SQL -- но теперь на pandas!

## Question 1
Question: Retrieve the names of all employees in department 5 who work more than 10 hours per week on the ProductX project!

SQL code to guide:
``` SQL
SELECT Fname, Lname
FROM EMPLOYEE, WORKS_ON, PROJECT 
WHERE Ssn=Essn
AND Pno=Pnumber
AND Dno=10
AND Hours>=10
AND Pname=’X’
```

In [14]:
output = ...

## Question 2
Question: List the names of all employees who have a
dependent with the same first name as themselves

SQL code to guide:
``` SQL
SELECT Fname, Lname
FROM EMPLOYEE, DEPENDENT
WHERE Ssn=Essn
AND Dependent_name=Fname
```

In [15]:
dependent = pd.read_csv("queries_data/dependent.csv")
dependent.head()

   essn dependent_name sex
0     1           anna   f
1     2         ronald   m
2     3         evgeny   m

In [16]:
output = ...

## Question 3
Question: Find the names of all employees who are directly
supervised by ronald dehaan


SQL code to guide:
``` SQL
SELECT E.Fname, E.Lname
FROM EMPLOYEE E, EMPLOYEE S
WHERE E.Super_ssn=S.Ssn
AND S.Fname=’ronald’
AND S.Lname=’dehaan’ 
```

In [17]:
output = ...

## Question  4
Question: For each project, list the project name and the total hours per week (by all employees) spent on that project

SQL code to guide:
``` SQL
SELECT Pno, Pname, SUM(Hours)
FROM PROJECT JOIN WORKS_ON ON Pno=Pnumber 
GROUP BY Pno, Pname
```

In [18]:
output = ...

## Question 5
Question: Retrieve the names of all employees who work on every project

SQL code to guide:
``` SQL
SELECT Fname, Lname FROM EMPLOYEE
WHERE NOT EXISTS
    (SELECT * FROM PROJECT
     WHERE NOT EXISTS (SELECT *
                       FROM WORKS_ON
                       WHERE Pno = Pnumber
                       AND Essn = Ssn
                      )
    )
```

In [1]:
output = ...

## Question 6
Question: Retrieve the average salary of all female employees

SQL code to guide:
``` SQL
SELECT AVG(Salary) 
FROM EMPLOYEE 
WHERE Sex=’F’
```

In [20]:
output = ...

## Question 7

Question: List the names of all department managers who have no dependents

SQL code to guide:
``` SQL
SELECT Fname, Lname
FROM EMPLOYEE, DEPARTMENT 
WHERE Ssn=Mgr_ssn
AND NOT EXISTS (SELECT *
                FROM DEPENDENT 
                WHERE Essn = Ssn)
```

In [21]:
output = ...